pages-html/syllabus.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en-us">

<head>
<title>Syllabus</title>
<!-- 2017-05-03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gonzalo Peraza" />
<link href="http://gmpg.org/xfn/11" rel="profile">

<!-- CSS -->
<link rel="stylesheet" href="../pages-html/public/css/poole.css">
<link rel="stylesheet" href="../pages-html/public/css/syntax.css">
<link rel="stylesheet" href="../pages-html/public/css/hyde.css">
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700|Abril+Fatface">

<!-- Icons -->
<link rel="apple-touch-icon" href="../pages-html/public/UPY-favicon.png">
<link rel="shortcut icon" href="../pages-html/public/favicon.ico">
<!-- Enable responsiveness on mobile devices-->
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1">
</head>
<body class="theme-base-upy">
<div id="preamble" class="sidebar">
<div class="container sidebar-sticky">
<div class="sidebar-about">
<h1>
<a href="../index.html"> Mathematical Functions  </a>
</h1>
<p class="lead">A UPY Course</p>
</div>

<nav class="sidebar-nav">
<a class="sidebar-nav-item" href="../index.html">Home</a>
<a class="sidebar-nav-item active" href="syllabus.html">Syllabus</a>
<a class="sidebar-nav-item" href="lectures.html">Lectures</a>
<a class="sidebar-nav-item" href="homework.html">Homework</a>
<a class="sidebar-nav-item" href="grades.html">Grades</a>
<a class="sidebar-nav-item" href="https://github.com/gperaza/math-func-upy-2017">Github repo</a>
<span class="sidebar-nav-item">May-June 2017</span>
</nav>

<p>&copy; Gonzalo Peraza. 2017-05-03</p>
</div>
</div>
<div class="content container">
<div class="page"><h1 class="page-title">Syllabus</h1>
<p class="message">I reserve the right to make changes to the syllabus</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Description</h2>
<div class="outline-text-2" id="text-1">
<p>
This is an introductory mathematics course that covers precalculus topics and
some vector algebra including an introduction to vector spaces.
</p>

<p>
<b>Objective:</b> The student will develop mathematical models using tools from
analytic geometry, trigonometry and vector algebra to contribute to the solution
of problems in their environment and the basic sciences
</p>

<p>
<b>Quarter:</b> Second
</p>

<p>
<b>Hours per week:</b> 4
</p>

<p>
<b>Total hours:</b> 60
</p>

<p>
<b>Prerequisites:</b> Basic algebra.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Outline</h2>
<div class="outline-text-2" id="text-2">
<p>
The curse will be structured in 3 mayor blocks with corresponding subtopics:
</p>

<ol class="org-ol">
<li>Functions
<ol class="org-ol">
<li>Units and rates
</li>
<li>The coordinate system
</li>
<li>Lines and circles
</li>
<li>Linear Modeling
</li>
<li>Functions, Graphs and Graphical Analysis
</li>
<li>Quadratic Modeling
</li>
<li>Composition of functions
</li>
<li>Inverse functions
</li>
<li>Exponential and logarithmic functions
</li>
<li>Transformations on functions
</li>
<li>Rational functions
</li>
</ol>
</li>
<li>Trigonometry
<ol class="org-ol">
<li>Measuring an angle
</li>
<li>Circular motion
</li>
<li>Circular and trigonometric functions
</li>
<li>Sinusoidal functions
</li>
<li>Inverse circular functions
</li>
</ol>
</li>
<li>Vector algebra
<ol class="org-ol">
<li>Vectors in two and three dimensions
</li>
<li>Linear transformations
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">References</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Main references</h3>
<div class="outline-text-3" id="text-3-1">
<p>
All main references are freely available with links provided below.
</p>
<ul class="org-ul">
<li><a href="https://sites.math.washington.edu/~m120/TheBook/TB2016.pdf">Precalculus</a> by Collingwood, Prince and Conroy. Content on functions and
trigonometry will follow this book.
</li>
<li><a href="http://immersivemath.com/ila/index.html">immersive linear algebra</a> by J. Ström, K. Åström,
and T. Akenine-Möller. Introduction to vector algebra will follow the first
chapters of this book.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Support references</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This book are provided as optional reference material. They cover roughly the
same topics and include a great number of practice exercises. Neither of them
was chosen as the main book because they all of them exceed the 1000 pages
count, far more than a typical student can absorb in a single quarter.
</p>
<ul class="org-ul">
<li>Álgebra y trigonometria con geometría analítica by Swokowski, E.
</li>
<li>Geometría plana y del espacio con trigonometría by Baldor, J.A.
</li>
<li><a href="https://openstax.org/details/algebra-and-trigonometry">Algebra and Trigonometry</a> published by openstax (free).
</li>
<li><a href="http://www.stitz-zeager.com/szprecalculus07042013.pdf">Precalculus</a> by Stitz and Zeager (free).
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Grading</h2>
<div class="outline-text-2" id="text-4">
<p>
The course is divided in 3 periods following roughly the 3 main units described
in the outline. Each period will consist of several sets of homework problems
and an exam. Per period grading is as follows:
</p>
<ul class="org-ul">
<li>40% Homework
</li>
<li>60% Exam
</li>
</ul>

<p>
Exam dates and topics will be posted on the Lectures page.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Homework</h2>
<div class="outline-text-2" id="text-5">
<p>
Homework will be posted in the course page after the corresponding lecture. All
homework must be delivered the indicated date (typically one week after posting)
without exception and must follow these guidelines:
</p>
<ul class="org-ul">
<li>White pages.
</li>
<li>A front page with name, group, date and homework number clearly stated.
</li>
<li>Pages stapled together.
</li>
<li>All exercises must be clearly delimited with the solution following the
instruction. The solution must be clearly written and easy to follow.
</li>
</ul>

<p>
Solutions will be posted after the delivery date for each homework.
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Class regulations</h2>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Advice to studying</h2>
<div class="outline-text-2" id="text-7">
<p>
Do all your homework, read the textbook when assigned to, and dedicate at least
another 8 hours to the course outside of class. Practice, practice,
practice. Ask, ask, ask.
</p>

<p>
The following notes are for University of Washington students taking a
Precalculus course based on the same book we are using, the same advice apply to
you: <a href="https://sites.math.washington.edu/~m120/math120studentnote.php">https://sites.math.washington.edu/~m120/math120studentnote.php</a>
</p>

<p>
Also, the following study guide may be helpful:
<a href="http://www.cse.buffalo.edu/~rapaport/howtostudy.html">http://www.cse.buffalo.edu/~rapaport/howtostudy.html</a>
</p>
</div>
</div>
</div>
</div></body>
</html>
